docs/meta/about.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="author" content="Tak" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='/css/stylesheet.css'>
</head>
<body>
<div id="nav" class="status">
<a href='/'>bacchanalian madness</a><a href='/rss.xml'>
    <button id='rss-button' aria-label='Get RSS feed' type='button'>
      <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 448 512' fill='currentColor'>
        <path d='M128.081 415.959c0 35.369-28.672 64.041-64.041 64.041S0 451.328 0 415.959s28.672-64.041 64.041-64.041 64.04 28.673 64.04 64.041zm175.66 47.25c-8.354-154.6-132.185-278.587-286.95-286.95C7.656 175.765 0 183.105 0 192.253v48.069c0 8.415 6.49 15.472 14.887 16.018 111.832 7.284 201.473 96.702 208.772 208.772.547 8.397 7.604 14.887 16.018 14.887h48.069c9.149.001 16.489-7.655 15.995-16.79zm144.249.288C439.596 229.677 251.465 40.445 16.503 32.01 7.473 31.686 0 38.981 0 48.016v48.068c0 8.625 6.835 15.645 15.453 15.999 191.179 7.839 344.627 161.316 352.465 352.465.353 8.618 7.373 15.453 15.999 15.453h48.068c9.034-.001 16.329-7.474 16.005-16.504z'></path>
      </svg>
    </button>
  </a><button id='dark-mode-button' aria-label='Toggle Dark Mode' type='button'>
    <svg id='moon-icon' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 20 20' fill='currentColor'>
      <path d='M17.293 13.293A8 8 0 016.707 2.707a8.001 8.001 0 1010.586 10.586z'></path>
    </svg>
    <svg id='sun-icon' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 20 20' fill='currentColor' style='display: none;'>
      <path d='M10 2a1 1 0 011 1v1a1 1 0 11-2 0V3a1 1 0 011-1zm4 8a4 4 0 11-8 0 4 4 0 018 0zm-.464 4.95l.707.707a1 1 0 001.414-1.414l-.707-.707a1 1 0 00-1.414 1.414zm2.12-10.607a1 1 0 010 1.414l-.706.707a1 1 0 11-1.414-1.414l.707-.707a1 1 0 011.414 0zM17 11a1 1 0 100-2h-1a1 1 0 100 2h1zm-7 4a1 1 0 011 1v1a1 1 0 11-2 0v-1a1 1 0 011-1zM5.05 6.464A1 1 0 106.465 5.05l-.708-.707a1 1 0 00-1.414 1.414l.707.707zm1.414 8.486l-.707.707a1 1 0 01-1.414-1.414l.707-.707a1 1 0 011.414 1.414zM4 11a1 1 0 100-2H3a1 1 0 000 2h1z' fill-rule='evenodd' clip-rule='evenodd'></path>
    </svg>
  </button>
</div>
<div id="content" class="content">
<header>
<h1 class="title">About</h1>
</header><div id="outline-container-orge7d520b" class="outline-2">
<h2 id="orge7d520b">Webpresence of Prashant Tak</h2>
<div class="outline-text-2" id="text-orge7d520b">
<blockquote>
<p>Why should a man climb Everest?
Because it is there.
-Meredith Edwards, The conquest of Everest
</p>
</blockquote>

<p>Hi! I&rsquo;m Prashant. This is something experimental for me, the entire <i>&ldquo;blog&rdquo;</i> experience. I&rsquo;ve never been someone who can openly share their thoughts so this might not end up being a personal blog and just a random collection of articles and notes but that&rsquo;s something which will be decided in the future.
</p>

<p>Some stuff that I came across recently which I enjoyed, presented here in case someone&rsquo;s interested.
</p>

<ul class="org-ul">
<li><a href="https://ncase.me/mental-health/">Mental Health</a>, don&rsquo;t fight your fear, accept it.</li>
<li><a href="https://substack.com/home/post/p-163622235">the hunger to be everything</a>, a substack post about abundance</li>
<li><a href="https://www.gwern.net/Design">Gwern - Design</a>, considerations to keep in mind while designing for the web.</li>
<li><a href="https://observablehq.com/@yurivish/efficient-graph-search">Efficient BFS</a></li>
<li><a href="https://ohshitgit.com/">Oh Shit Git</a>, for when you can&rsquo;t recall that specific command to do that particular thing.</li>
<li><a href="https://www.chessengines.org/">Chess Engines</a>, how to code a chess engine</li>
<li><a href="https://kkovacs.eu/cool-but-obscure-unix-tools/">Cool but Obscure unix tools</a></li>
<li><a href="https://jsomers.net/i-should-have-loved-biology/">I should have loved biology</a></li>
<li><a href="https://www.explainxkcd.com/wiki/index.php/2541:_Occam">Explain XKCD: Occam</a></li>
<li><a href="https://publicservicebroadcasting.bandcamp.com/album/live-at-brixton">PSB - Live at Brixton</a>, a surreal experience. Tracks that I enjoyed: <i>Sputnik, Theme from PSB, Night Mail, Go!, Everest</i>.</li>
<li><a href="https://www.poetryfoundation.org/poems/43997/the-rime-of-the-ancient-mariner-text-of-1834">The Rime of the Ancient Mariner</a>, it was part of my school curiculum, randomly thought of it today.</li>
<li><a href="https://www.programiz.com/cpp-programming/lambda-expression">Lambda Expressions in C++</a></li>
</ul>
</div>
</div>
</div>
<footer id="postamble" class="status">
&copy; 2026 . Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11).
</footer>
</body>
</html>
