content/meta/about.md
+++
title = "About"
author = ["Prashant Tak"]
date = 2021-03-21T01:00:00+05:30
lastmod = 2025-04-28T09:04:41+05:30
draft = false
creator = "Emacs 30.1 (Org mode 9.7.11 + ox-hugo)"
+++

## Webpresence of Prashant Tak {#webpresence-of-prashant-tak}

<div class="epigraph">

Why should a man climb Everest?
Because it is there.

<div class="epicite">

-Meredith Edwards, The conquest of Everest

</div>

</div>

Hi! I'm Prashant. This is something experimental for me, the entire _"blog"_ experience. I've never been someone who can openly share their thoughts so this might not end up being a personal blog and just a random collection of articles and notes but that's something which will be decided in the future.

Some stuff that I came across recently which I enjoyed, presented here in case someone's interested.

-   [Mental Health](https://ncase.me/mental-health/), don't fight your fear, accept it.
-   [Gwern - Design](https://www.gwern.net/Design), considerations to keep in mind while designing for the web.
-   [Efficient BFS](https://observablehq.com/@yurivish/efficient-graph-search)
-   [Oh Shit Git](https://ohshitgit.com/), for when you can't recall that specific command to do that particular thing.
-   [Chess Engines](https://www.chessengines.org/), how to code a chess engine
-   [Cool but Obscure unix tools](https://kkovacs.eu/cool-but-obscure-unix-tools/)
-   [I should have loved biology](https://jsomers.net/i-should-have-loved-biology/)
-   [Explain XKCD: Occam](https://www.explainxkcd.com/wiki/index.php/2541:_Occam)
-   [PSB - Live at Brixton](https://publicservicebroadcasting.bandcamp.com/album/live-at-brixton), a surreal experience. Tracks that I enjoyed: _Sputnik, Theme from PSB, Night Mail, Go!, Everest_.
-   [The Rime of the Ancient Mariner](https://www.poetryfoundation.org/poems/43997/the-rime-of-the-ancient-mariner-text-of-1834), it was part of my school curiculum, randomly thought of it today.
-   [Lambda Expressions in C++](https://www.programiz.com/cpp-programming/lambda-expression)
